RU/Version3/Files/day2-1/Problem-class-4/case-15/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM Extend Project: Open Source CFD        |
|  \\    /   O peration     | Version:  1.6-ext                               |
|   \\  /    A nd           | Web:      www.extend-project.de                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 1e+6;

boundaryField
{
    inlet
    {
        type            totalPressure;
        phi		phi;
        psi		thermo:psi;
        gamma		1.3;
        p0		uniform 1e+6;
        value		uniform 1e+6;
    }

    outlet
    {
        type            waveTransmissive;
        field           p;
        phi             phi;
        rho		rho;
        psi             thermo:psi;
        gamma           1.3;
        fieldInf        1e5;
        lInf            0.01;
        inletOutlet     off;
        correctSupercritical off;
        value           uniform 1e5;
    }

    walls
    {
        type            zeroGradient;
    }

    defaultFaces
    {
        type            empty;
    }
}

// ************************************************************************* //
